<?php

$lang['1400'] = 'Администратор имеет доступ ко всем словарям.';
$lang['1379'] = 'Распечатать';
$lang['1378'] = 'Отобразить версию для печати этой страницы.';
$lang['1377'] = 'Добавить этот словарь к списку поисковых машин в вашем браузере.';
$lang['1376'] = 'Дайте нам знать о любой найденной вами ошибке.';
$lang['1375'] = 'Отправить новый термин к этому словарю.';
$lang['1373'] = 'Отмечено';
$lang['1372'] = 'Вы уверены что хотите выбрать все термины в словаре?';
$lang['1371'] = 'Все термины';
$lang['1368'] = 'секунды';
$lang['1367'] = 'Время выполнения';
$lang['1366'] = 'Объем занимаемой памяти';
$lang['1365'] = 'Максимальное время выполнения';
$lang['mb'] = 'МБ';
$lang['1363'] = 'Сменить идентификатор (ID) словаря';
$lang['1353'] = 'Отправитель';
$lang['1349'] = 'Пожалуйста, укажите ваш e-mail или логин. Письмо со ссылкой на сброс пароля будет отправлено на e-mail адрес, соответствующий вашей учетной записи.';
$lang['1341'] = 'Выберите профиль';
$lang['1340'] = 'Летнее время/<acronym title="Декретное летнее время">DST</acronym>';
$lang['1339'] = 'Фамилия';
$lang['1338'] = 'Имя';
$lang['1337'] = 'Пользователи';
$lang['1336'] = 'Аббревиатуры';
$lang['1335'] = 'Словари';
$lang['1334'] = 'Цветовые схемы';
$lang['1333'] = 'Темы';
$lang['1332'] = 'Установки сохранены';
$lang['1331'] = 'Компонент';
$lang['virtual_keyboard'] = 'Виртуальная клавиатура';
$lang['audio'] = 'Звуковой файл';
$lang['1289'] = 'Имя профиля';
$lang['custom_az'] = 'Индивидуальный алфавитный порядок';
$lang['1285'] = 'Персональные данные сохранены не будут.';
$lang['1282'] = 'Термины, определенные в ‘%s’';
$lang['1281'] = 'Термины, начинающиеся с ‘%s’';
$lang['1277'] = 'Интересная страница';
$lang['1276'] = 'Пожалуйста посмотри на эту страницу. Мне кажется она тебе понравится.
%s
%s';
$lang['1269'] = 'Код подтверждения';
$lang['1234'] = 'Найдено';
$lang['1233'] = 'Не найдено';
$lang['1214'] = 'Почтовые сообщения';
$lang['1213'] = 'Запомнить выбор';
$lang['1212'] = 'OK';
$lang['1185'] = 'Следующий шаг';
$lang['1183'] = 'Перейти на следующий шаг.';
$lang['1168'] = 'Шаг';
$lang['1151'] = 'Число месяца';
$lang['1144'] = 'Результаты поиска';
$lang['custom_pages'] = 'Индивидуальные страницы';
$lang['3_all_time'] = 'Весь период';
$lang['1115'] = 'Все словари';
$lang['1114'] = 'Любая';
$lang['1113'] = 'Любой';
$lang['time_gmt'] = 'Время указано в GMT';
$lang['week'] = 'Неделя';
$lang['1112'] = 'Редакторы';
$lang['1109'] = 'Ваш аватар в размерах должен быть не больше %d на %d пикселей. 
Загруженные аватары с вашего компьютера должны быть не больше %d КБ.';
$lang['1108'] = 'Закачать новое изображение с&#160;вашего компьютера';
$lang['antonym'] = 'Антоним';
$lang['1104'] = 'Часовой пояс';
$lang['1075'] = '<p><strong>Помощь в поиске</strong></p>
<ul>
<li><p>Поисковые запросы не зависят от регистра и диакритических знаков.</p></li>

<li><p>Режим поиска по умолчанию - ‘искать со всеми словами’. 
Вы можете улучшать результат поиска, 
добавляя больше слов к уже введенному запросу.</p></li>

<li>
<p>Вы можете смешивать знаки ‘*’ и ‘?’ с вашим запросом. Например:</p>
<ul>
<li>запрос ‘ab*’ покажет все слова, начинающиеся с ‘ab’.</li>
<li>запрос ‘*ca’ покажет все слова, оканчивающиеся на ‘ca’.</li>
<li>запрос ‘t?me’ покажет записи ‘time’, ‘tome’ и ‘tame’.</li>
</ul>
&#160;
</li>
<li><p>Некоторые общие слова, такие как ‘the’, ‘is’, ‘to’ могут быть проигнорированы
поисковой системой в зависимости от установок словаря.</p>
</li>
</ul>';
$lang['1071'] = 'С отмеченными';
$lang['page'] = 'Страница';
$lang['task_list'] = 'Список задач';
$lang['bug_report'] = 'Сообщить об ошибке';
$lang['page_options'] = 'Опции страницы';
$lang['requests_total'] = 'Запросов всего';
$lang['srch_3'] = 'Поисковый запрос';
$lang['srch_2'] = 'Найдено в словарях';
$lang['srch_-1'] = 'Искать в терминах и в определениях';
$lang['srch_5'] = 'запросов за месяц';
$lang['srch_6'] = 'время поиска';
$lang['select_off'] = 'Снять отметку со всех';
$lang['select_on'] = 'Отметить все';
$lang['page_link_dict'] = 'Ссылка на словарь';
$lang['page_fav'] = 'Добавить в избранное';
$lang['page_link_term'] = 'Ссылка на этот термин';
$lang['abbr'] = 'Аббревиатура';
$lang['phone'] = 'Телефон';
$lang['address'] = 'Адрес';
$lang['usg'] = 'Примеры употребления';
$lang['trsp'] = 'Транскрипция';
$lang['000'] = '-нет-';
$lang['3_password_send'] = 'Выслать пароль';
$lang['3_password_lost'] = 'Забыли пароль?';
$lang['2_page_22'] = 'Смена пароля';
$lang['contact_email'] = 'Контактный e-mail';
$lang['contact_name'] = 'Контактное лицо';
$lang['user_location'] = 'Страна, город';
$lang['online'] = 'На линии';
$lang['3_login'] = 'Войти';
$lang['2_login'] = 'Для авторов';
$lang['password'] = 'Пароль';
$lang['login'] = 'Логин';
$lang['fb_fill'] = 'Пожалуйста, заполните форму.';
$lang['tip014'] = '%s - обновлено за последние %d дней.';
$lang['fb_complete'] = 'Спасибо за сообщение.';
$lang['total'] = 'Всего';
$lang['terms'] = 'Термины';
$lang['see'] = 'См.';
$lang['3_profile'] = 'Профиль';
$lang['y_email'] = 'Ваш e-mail';
$lang['array_month_short'] = 'Янв Фев Мар Апр Май Июн Июл Авг Сен Окт Ноя Дек';
$lang['array_month_decl'] = 'Января Февраля Марта Апреля Мая Июня Июля Августа Сентября Октября Ноября Декабря';
$lang['array_month_long'] = 'Январь Февраль Март Апрель Май Июнь Июль Август Сентябрь Октябрь Ноябрь Декабрь';
$lang['user'] = 'Пользователь';
$lang['src'] = 'Источник';
$lang['defn'] = 'Определение';
$lang['syn'] = 'Син.';
$lang['trns'] = 'Перевод';
$lang['size'] = 'Размер';
$lang['is_1'] = 'Вкл.';
$lang['is_0'] = 'Выкл.';
$lang['dict'] = 'Словарь';
$lang['mrk_upd'] = 'обновлено';
$lang['mrk_new'] = 'новое';
$lang['today'] = 'Сегодня';
$lang['3_yes'] = 'Да';
$lang['3_no'] = 'Нет';
$lang['1_nextpage'] = 'След.';
$lang['lang'] = 'Язык интерфейса';
$lang['3_top'] = 'к началу страницы';
$lang['3_tomain'] = 'на заглавную';
$lang['L_pages'] = 'Страницы';
$lang['termsamount'] = 'Кол-во терминов';
$lang['descr'] = 'Описание';
$lang['printversion'] = 'Версия для печати';
$lang['srch_tryall'] = 'Попробуйте <a href="%s">найти во всех словарях</a>.';
$lang['srch_trydefn'] = 'Попробуйте <a href="%s">найти в определениях</a> или <a href="%s">во всех словарях</a>.';
$lang['srch_tryterm'] = 'Попробуйте <a href="%s">найти в терминах</a>.';
$lang['srch_1'] = 'Искать в терминах';
$lang['3_srch_submit'] = 'Поиск';
$lang['srch_phrase'] = 'Искать';
$lang['srch_matches'] = 'Найдено';
$lang['srch_strict'] = 'только в этом словаре';
$lang['srch_0'] = 'Искать в определениях';
$lang['srch_all'] = 'Все словари';
$lang['month'] = 'Месяц';
$lang['yesterday'] = 'Вчера';
$lang['definitions'] = 'Определения';
$lang['root_topic'] = 'Главная';
$lang['topic_list'] = 'Список тем';
$lang['9_remove'] = 'Вы уверены?';
$lang['2_success'] = 'Операция выполнена успешно.';
$lang['status'] = 'Статус';
$lang['topic'] = 'Тема';
$lang['termsnewamount'] = 'Новых терминов';
$lang['str_page_of_page'] = 'страница %s из %s';
$lang['str_on_page'] = 'терминов';
$lang['stat_dict'] = 'Словарей';
$lang['stat_defn'] = 'Терминов';
$lang['bytes'] = 'байт';
$lang['kb'] = 'КБ';
$lang['message'] = 'Сообщение';
$lang['y_name'] = 'Ваше имя';
$lang['web_stat'] = 'Статистика';
$lang['web_m_top10'] = '10 самых';
$lang['web_m_fb'] = 'Обратная связь';
$lang['term'] = 'Термин';
/**
 * The end of translation file.
 */
?>